# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 10  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]


backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 1, MSEFM, [128]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 1, MSEFM, [256]]
  - [-1, 1, Conv, [384, 3, 2]]  # 5-P4/16
  - [-1, 1, MSEFM, [384]]
  - [-1, 1, Conv, [384, 3, 2]]  # 7-P5/32
  - [-1, 3, MSEFM, [384]]

head:
  - [-1, 1, Conv, [256, 1, 1, None, 1, 1, False]]  # 9 input_proj.2
  - [-1, 1, TransformerEncoderLayer_DPB, [1024]] # 10
  - [-1, 1, Conv, [256, 1, 1]]  # 11, Y5, lateral_convs.0

  - [[-1, 6], 1, SBA, []] # 12
  - [-1, 3, RepC3, [128, 0.5]] # 13

  - [-1, 1, DySample, [2, 'lp']] # 14
  - [2, 1, SPDConv, [128]] # 15
  - [[-1, -2, 4], 1, Concat, [1]] # 16
  - [-1, 1, CSPOmniKernel, []] # 17
  - [-1, 3, RepC3, [256, 0.5]] # 18

  - [[-1, 13], 1, SBA, []] # 19
  - [-1, 3, RepC3, [256, 0.5]] # 20

  - [[-1, 11], 1, SBA, []] # 21
  - [-1, 3, RepC3, [256, 0.5]] # 22

  - [[18, 20, 22], 1, RTDETRDecoder, [nc, 256, 300, 4, 8, 3]]  # RTDETRDecoder(P3, P4, P5)